Revit 2027 API
RebarHostData.SetCommonCoverType Method
 Associate a single CoverType with all exposed faces of the host element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCommonCoverType(
	RebarCoverType coverType
)
Public Sub SetCommonCoverType (
	coverType As RebarCoverType
)
public:
void SetCommonCoverType(
	RebarCoverType^ coverType
)
member SetCommonCoverType :
        coverType : RebarCoverType -> unit
Parameters
coverType RebarCoverType
 A CoverType object to be applied to all faces.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace